In [11]:
import pandas as pd
import numpy as np

In [4]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep='\s+', header=None)

In [5]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [6]:
df_data.columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

### series

In [7]:
from pandas import Series, DataFrame

In [8]:
list_data = [1,2,3,4,5]
example_obj = Series(data= list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data= list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(data= dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [13]:
example_obj["a"]

1.0

In [14]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [15]:
example_obj.values

array([3.2, 2. , 3. , 4. , 5. ], dtype=float32)

In [16]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [17]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a","b","c","d","e","f","g","h"]
series_obj_1 = Series(dict_data_1, index = indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

### dataframe

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [13]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age': [42, 52, 36, 24, 73],
           'city': ['San Francisco', 'Baltimore', 'Miami', 'Dougias', 'Boston']}

df = pd.DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Dougias
4        Amy     Cooze   73         Boston

In [14]:
#column 선택
DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Dougias
4   73         Boston

In [15]:
#새로운 column 추가
DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Dougias  NaN
4        Amy     Cooze   73         Boston  NaN

In [16]:
# column 선택 = series 추출
df = DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [17]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [18]:
# loc - index location
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [19]:
#iloc = index position
df["age"].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [20]:
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [21]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [23]:
df.debt = df.age>40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Dougias  False
4        Amy     Cooze   73         Boston   True

In [24]:
# transpose

df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Dougias  Boston
debt                 True       True  False    False    True

In [26]:
# df 값 출력

df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Dougias', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [27]:
# csv로 변환

df.to_csv()

',first_name,last_name,age,city,debt\r\n0,Jason,Miller,42,San Francisco,True\r\n1,Molly,Jacobson,52,Baltimore,True\r\n2,Tina,Ali,36,Miami,False\r\n3,Jake,Milner,24,Dougias,False\r\n4,Amy,Cooze,73,Boston,True\r\n'

In [32]:
# column 삭제
del df["debt"]
df

KeyError: 'debt'

In [31]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Dougias
4        Amy     Cooze   73         Boston

### section & drop

In [34]:
# selection- 한개의 column 선택

df["city"].head(3)

0    San Francisco
1        Baltimore
2            Miami
Name: city, dtype: object

In [36]:
# 여러개 column 선택

df[["first_name", "city"]].head(3)

  first_name           city
0      Jason  San Francisco
1      Molly      Baltimore
2       Tina          Miami

In [37]:
# row 기준 표시

df[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

In [40]:
age_series = df["age"]
age_series[age_series<45]

0    42
2    36
3    24
Name: age, dtype: int64

In [43]:
# index 변경

df.index = df["age"]
del df["age"]
df.head()

    first_name last_name           city
age
42       Jason    Miller  San Francisco
52       Molly  Jacobson      Baltimore
36        Tina       Ali          Miami
24        Jake    Milner        Dougias
73         Amy     Cooze         Boston

In [44]:
# loc - column과 index name

df.loc[[42,52], ["first_name", "city"]]

    first_name           city
age
42       Jason  San Francisco
52       Molly      Baltimore

In [45]:
# iloc - column number와 index number

df.iloc[:2, :2]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [46]:
# index 재설정

df.index = list(range(5))
df.head()

  first_name last_name           city
0      Jason    Miller  San Francisco
1      Molly  Jacobson      Baltimore
2       Tina       Ali          Miami
3       Jake    Milner        Dougias
4        Amy     Cooze         Boston

In [47]:
# data drop - row

df.drop(1)

  first_name last_name           city
0      Jason    Miller  San Francisco
2       Tina       Ali          Miami
3       Jake    Milner        Dougias
4        Amy     Cooze         Boston

In [48]:
# data drop - column

df.drop("city", axis=1)

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali
3       Jake    Milner
4        Amy     Cooze

### dataframe operations

In [50]:
s1 = Series(range(1,6), index=list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [51]:
s2 = Series(range(5,11), index=list("becdef"))
s2

b     5
e     6
c     7
d     8
e     9
f    10
dtype: int64

In [52]:
# index 기준으로 연산수행
# 겹치는 index가 없으면 NaN값 반환

s1.add(s2)

a     NaN
b     7.0
c    10.0
d    13.0
e    10.0
e    13.0
f     NaN
dtype: float64

In [53]:
s1+s2

a     NaN
b     7.0
c    10.0
d    13.0
e    10.0
e    13.0
f     NaN
dtype: float64

In [54]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [55]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [56]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [57]:
# df는 column과 index를 모두 고려
# column과 index가 맞지 않으면 NaN값을 반환하고 fill_value를 조정해서 df1의 NaN값을 0으로 반환

df1.add(df2, fill_value=0) # operation types: add, sub, div, mul

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [71]:
df1.mul(df2, fill_value=1)

      a     b     c     d
0   0.0   1.0   4.0   3.0
1  12.0  20.0  30.0   7.0
2  48.0  63.0  80.0  11.0
3  12.0  13.0  14.0  15.0

In [58]:
df = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [67]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [60]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [69]:
# axis를 기준으로 row broadcasting 

df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [70]:
df.add(s2, axis=1)

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

### lambda, map, apply

In [62]:
s1 = Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [63]:
# Series type 데이터에도 map 함수 사용 가능 & function 대신 dict, seq형 자료등으로 대체 가능

s1.map(lambda x:x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [64]:
# dict type으로 데이터 교체. 없는 값을 NaN

z = {1:'A', 2:'B', 3:'C'}
s1.map(z).head()

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [65]:
# 같은 위치의 데이터를 s2로 전환


s2 = Series(np.arange(10,20))
s1.map(s2).head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [83]:
s1 # 변화되지 않음

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [72]:
# map for series

df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [73]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [76]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [78]:
df.sex.replace({"male":0, "female":1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [79]:
df.sex.replace(["male", "female"], # target list
               [0,1], # conversion list
               inplace=True) # inplace: 데이터 변화 결과를 적용
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [87]:
df.drop('sex_code', axis=1, inplace=True)

KeyError: "['sex_code'] not found in axis"

In [88]:
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

In [89]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [90]:
f = lambda x: x.max()-x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [91]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [92]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [93]:
f = lambda x: -x

df_info.applymap(f).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [95]:
def f(x):
    return Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index=["min", "max", "mean", "null"]
    )

df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000